blog/Jazz_piano.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Jazz Piano Tutorial</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content">
<h1 class="title">Jazz Piano Tutorial</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org870fda7">Harmony</a>
<ul>
<li><a href="#org41ebc65">Block chord</a></li>
<li><a href="#org0bd0a96">Upper Structure</a></li>
<li><a href="#orgf67ee8f">Evenly spaced Scale</a></li>
</ul>
</li>
<li><a href="#org2234a16">Melody</a>
<ul>
<li><a href="#org017d078">Scales</a>
<ul>
<li><a href="#org68852d3">Kinds of scales</a></li>
<li><a href="#orgf4ca4a5">Perspective: Combination of half step chunks and whole step chunks</a></li>
<li><a href="#org7977749">Using scale</a></li>
</ul>
</li>
<li><a href="#orgb776e29">Positions</a></li>
<li><a href="#orgd40772e">Bebop licks</a>
<ul>
<li><a href="#org6e2e648">Basic structure</a></li>
<li><a href="#org2838836">Famous/Favor licks</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org6ffab24">Rhythm</a></li>
<li><a href="#orgf026259">Tasks</a>
<ul>
<li><a href="#orgad4ea7f"><span class="todo TODO">TODO</span> Get task/workshop/practice for each drill</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
This is a tutorial for myself. I started the tutorial as a newbie of jazz piano players.
</p>

<p>
The material is limited to a 32-key MIDI controller and a computer, as perfect much as what I have got.
</p>

<p>
I divided the whole jazz piano machine mainly into harmony, melody and rhythm.
</p>

<p>
This is not a start-from-scratch tutorial, the kind I usually recommand, but rather a index of drills I collected from various of resources. In this paradigm, the 3 aspects below are the base class/categories of elements one should consider in a jazz piano playing session. They can also be seen as attributes of charactor in RPG like DEF, ATK, or AGI, whereas practicing the drills would increase the value of the attributes.
</p>
<div id="outline-container-org870fda7" class="outline-2">
<h2 id="org870fda7">Harmony</h2>
<div class="outline-text-2" id="text-org870fda7">
</div>
<div id="outline-container-org41ebc65" class="outline-3">
<h3 id="org41ebc65">Block chord</h3>
</div>
<div id="outline-container-org0bd0a96" class="outline-3">
<h3 id="org0bd0a96">Upper Structure</h3>
</div>
<div id="outline-container-orgf67ee8f" class="outline-3">
<h3 id="orgf67ee8f">Evenly spaced Scale</h3>
<div class="outline-text-3" id="text-orgf67ee8f">
<p>
1st, 3rd and 7th from D Dorian.
or 2nd, 5th, 7th, 12th, 13th from D Dorian.
</p>
</div>
</div>
</div>



<div id="outline-container-org2234a16" class="outline-2">
<h2 id="org2234a16">Melody</h2>
<div class="outline-text-2" id="text-org2234a16">
<p>
the percpectives below could be considered:
</p>
</div>
<div id="outline-container-org017d078" class="outline-3">
<h3 id="org017d078">Scales</h3>
<div class="outline-text-3" id="text-org017d078">
<p>
Scales could be chosen according to current chord or current tone(consisting bunch of chords).
</p>

<p>
Use scale as available set of notes.
</p>
</div>
<div id="outline-container-org68852d3" class="outline-4">
<h4 id="org68852d3">Kinds of scales</h4>
</div>
<div id="outline-container-orgf4ca4a5" class="outline-4">
<h4 id="orgf4ca4a5">Perspective: Combination of half step chunks and whole step chunks</h4>
<div class="outline-text-4" id="text-orgf4ca4a5">
<p>
Scale could be viewed as combination of chunks of half/whole step.
</p>

<p>
For example, a Major scale could be viewed as 123 4567, grouped to 2 chunks of whole steps, while a dorian could be viewed as 12 3456 7.
</p>

<p>
As the pattern of whole step is easy on keyboard, this view provide an easy way to walk through scales with less calculation.
</p>
</div>
</div>

<div id="outline-container-org7977749" class="outline-4">
<h4 id="org7977749">Using scale</h4>
<div class="outline-text-4" id="text-org7977749">
</div>
<ul class="org-ul">
<li><a id="orgae60d43"></a>Switching scales<br />
<div class="outline-text-5" id="text-orgae60d43">
<p>
Switch from one scale to another could make the sound a lot different and messed up your freind watching you playing as you're playing almost all of the 12 notes in an octave.
</p>

<p>
This could be practiced by simply improvising on scale A for 4 bar and on scale B for 4 bar right after.
</p>
</div>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgb776e29" class="outline-3">
<h3 id="orgb776e29">Positions</h3>
<div class="outline-text-3" id="text-orgb776e29">
<p>
You'll need at least 3 positions on each scale: thumb at 1st, 4th and 6th.
The minimal is 1st and 4th, which is the way your playing through the scale.
</p>

<p>
While you're playing, you're not likely to move your hand around without reason. So the positions often used could be a entrance for further improvisation. A simple lick could do.
</p>

<p>
Position could also be a way to remember the scale.
</p>
</div>
</div>
<div id="outline-container-orgd40772e" class="outline-3">
<h3 id="orgd40772e">Bebop licks</h3>
<div class="outline-text-3" id="text-orgd40772e">
<p>
Practice licks from bebop
</p>
</div>

<div id="outline-container-org6e2e648" class="outline-4">
<h4 id="org6e2e648">Basic structure</h4>
<div class="outline-text-4" id="text-org6e2e648">
<p>
Enclosure and approching on every scale could be practiced.
</p>

<p>
This could be practiced by conducting structure and apply it to every note on a particular scale. It could be in a Hannon manner, from Do , Re to Ti; or follow the order of arppegio; or other order of choice.
</p>
</div>
</div>
<div id="outline-container-org2838836" class="outline-4">
<h4 id="org2838836">Famous/Favor licks</h4>
<div class="outline-text-4" id="text-org2838836">
<p>
Could transform licks heard from pieces of sounds to structure applying to every scale and note position.
</p>

<p>
For example, a 2345312 lick could be placed on:
</p>
<ul class="org-ul">
<li>C major scale, starting from D</li>
<li>C major scale, starting from E(could be argued of being in D Dorian scale)</li>
<li>C Dorian scale, starting from D</li>
<li>C Dorian Scale, starting from Eb</li>
<li>D major scale, starting from E</li>
</ul>

<p>
Note that the second way above could also be seen as in D Dorian scale, but thinking it as starting from II of C major scale would have the benefit of applying the lick everywhere on scale, without too much thinking.
</p>

<p>
The exercise regarding licks have a goal to familiar both hand and ear, and majorly ear. Every piano player can play a lot of phrases, like a piece of Chopin or Beethoven, and it's of little difficulty. Being able to have the phrases pop up in your ear and make the order to play the phrace to your hand means that you can use the phrace to enrich your vocabulary.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org6ffab24" class="outline-2">
<h2 id="org6ffab24">Rhythm</h2>
</div>
<div id="outline-container-orgf026259" class="outline-2">
<h2 id="orgf026259">Tasks</h2>
<div class="outline-text-2" id="text-orgf026259">
</div>
<div id="outline-container-orgad4ea7f" class="outline-3">
<h3 id="orgad4ea7f"><span class="todo TODO">TODO</span> Get task/workshop/practice for each drill</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 26.3 (<a href="https://orgmode.org">Org</a> mode 9.1.9)</p>
<p class="validation"></p>
</div>
</body>
</html>
